backend2/Bilinho/app/controllers/api/v1/enrollments_controller.rb

SELECT "enrollments".* FROM "enrollments" ORDER BY created_at DESC
SELECT "bills".* FROM "bills" WHERE "bills"."enrollment_id" = $1  [["enrollment_id", 58]]
---
			def index
				enrollments = Enrollment.order('created_at ASC');
        enrollmentCount = []
        count=0
        while count<params["count"] do
          enrollmentCount.push(enrollments[count],bills:Bill.where(enrollment_id:enrollments[count].id) )

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
---
			def show
				enrollment = Enrollment.find(params[:id])

INSERT INTO "enrollments" ("amount", "installments", "due_day", "created_at", "updated_at", "student_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 3000], ["installments", 2], ["due_day", 15], ["created_at", "2022-12-11 01:39:40.014268"], ["updated_at", "2022-12-11 01:39:40.014268"], ["student_id", 5]]
SELECT "bills".* FROM "bills" WHERE "bills"."enrollment_id" = $1  [["enrollment_id", 77]]
---
			def create
				enrollment = Enrollment.new(enrollment_params)
				if enrollment.save
          bills=Bill.where(enrollment_id:enrollment.id)

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
DELETE FROM "enrollments" WHERE "enrollments"."id" = $1  [["id", 63]]
---
			def destroy
				enrollment = Enrollment.find(params[:id])
				enrollment.destroy

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "enrollments" SET "installments" = $1, "updated_at" = $2 WHERE "enrollments"."id" = $3  [["installments", 4], ["updated_at", "2022-12-10 22:52:28.374193"], ["id", 55]]
---
			def update
				enrollment = Enrollment.find(params[:id])
				if enrollment.update_attributes(enrollment_params)