backend2/Bilinho/app/controllers/api/v1/students_controller.rb

SELECT "students".* FROM "students" ORDER BY created_at DESC
---
			def index
				students = Student.order('created_at ASC');

INSERT INTO "students" ("name", "cpf", "birthdate", "payment_method", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Carlos"], ["cpf", "12378945629"], ["birthdate", "1998-01-18"], ["payment_method", "boleto"], ["created_at", "2022-12-11 01:17:11.542721"], ["updated_at", "2022-12-11 01:17:11.542721"]]
---
			def create
				student = Student.new(student_params)
				if student.save

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 3]]
---
			def destroy
				student = Student.find(params[:id])
				student.destroy

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
			def update
				student = Student.find(params[:id])