backend/Bilinho/app/controllers/api/v1/bills_controller.rb

SELECT "bills".* FROM "bills"
---
      def index
        @bills = Bill.all