backend/Bilinho/app/controllers/api/v1/enrollments_controller.rb

SELECT "enrollments".* FROM "enrollments" ORDER BY created_at DESC
SELECT "bills".* FROM "bills" WHERE "bills"."enrollment_id" = $1  [["enrollment_id", 58]]
UPDATE "enrollments" SET "installments" = $1, "updated_at" = $2 WHERE "enrollments"."id" = $3  [["installments", 4], ["updated_at", "2022-12-10 22:52:28.374193"], ["id", 55]]
INSERT INTO "enrollments" ("amount", "installments", "due_day", "created_at", "updated_at", "student_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 1000], ["installments", 2], ["due_day", 5], ["created_at", "2022-12-10 21:25:10.409284"], ["updated_at", "2022-12-10 21:25:10.409284"], ["student_id", 2]]
---
			def index
				enrollments = Enrollment.order('created_at ASC');
				enrollmentCount = []
				count=0
				while count<params["count"] do
					bills=Bill.where(enrollment_id:enrollments[count].id)
					enrollmentCount.push({
						id:enrollments[count].id,
						student_id:enrollments[count].student_id,
						amount:enrollments[count].amount,
						installments:enrollments[count].installments,
						due_day:enrollments[count].due_day,
						bills:bills
					})

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 148], ["LIMIT", 1]]
---
			def show
				enrollment = Enrollment.find(params[:id])

INSERT INTO "enrollments" ("amount", "installments", "due_day", "created_at", "updated_at", "student_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 300], ["installments", 3], ["due_day", 10], ["created_at", "2022-12-12 00:34:28.345187"], ["updated_at", "2022-12-12 00:34:28.345187"], ["student_id", 2]]
SELECT "bills".* FROM "bills" WHERE "bills"."enrollment_id" = $1  [["enrollment_id", 130]]
---
			def create
				enrollment = Enrollment.new(enrollment_params)
				if enrollment.save
					#createBills=CreateBills.new()
					#createBills.create_bills(self)
         			bills=Bill.where(enrollment_id:enrollment.id)

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "enrollments" WHERE "enrollments"."id" = $1  [["id", 130]]
---
			def destroy
				enrollment = Enrollment.find(params[:id])
				enrollment.destroy

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 148], ["LIMIT", 1]]
UPDATE "enrollments" SET "installments" = $1, "updated_at" = $2 WHERE "enrollments"."id" = $3  [["installments", 3], ["updated_at", "2022-12-14 12:20:00.962753"], ["id", 158]]
---
			def update
				enrollment = Enrollment.find(params[:id])
				if enrollment.update_attributes(enrollment_params)