backend/Bilinho/app/controllers/api/v1/students_controller.rb

SELECT "students".* FROM "students" ORDER BY created_at DESC
INSERT INTO "students" ("name", "cpf", "birthdate", "payment_method", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Raissa"], ["cpf", "12378945688"], ["birthdate", "1988-05-18"], ["payment_method", "boleto"], ["created_at", "2022-12-10 21:29:11.950448"], ["updated_at", "2022-12-10 21:29:11.950448"]]
---
			def index
				students = Student.order('created_at ASC');
				studentCount = []
				count=0
				while count<params["count"] do
					studentCount.push({
						id:students[count].id,
						name:students[count].name,
						cpf:students[count].cpf,
						birthdate:students[count].birthdate,
						payment_method:students[count].payment_method
					})

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
			def show
				student = Student.find(params[:id])

INSERT INTO "students" ("name", "cpf", "birthdate", "payment_method", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sônia"], ["cpf", "12377945678"], ["birthdate", nil], ["payment_method", "credit_card"], ["created_at", "2022-12-12 00:40:23.942146"], ["updated_at", "2022-12-12 00:40:23.942146"]]
---
			def create
				student = Student.new(student_params)
				if student.save

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 3]]
---
			def destroy
				student = Student.find(params[:id])
				student.destroy

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "payment_method" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["payment_method", "boleto"], ["updated_at", "2022-12-14 11:03:24.260888"], ["id", 11]]
---
			def update
				student = Student.find(params[:id])
				if student.update_attributes(student_params)