backend/Bilinho/app/services/create_bills.rb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", 149], ["LIMIT", 1]]
---
    def initialize(params={})
        @enrollment=Enrollment.find(params[:enrollment_id])

INSERT INTO "bills" ("amount", "due_date", "status", "created_at", "updated_at", "enrollment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 250], ["due_date", "2023-01-12"], ["status", "open"], ["created_at", "2022-12-13 14:22:38.126328"], ["updated_at", "2022-12-13 14:22:38.126328"], ["enrollment_id", 147]]
---
    def create_bills
        @bills.each do |bill|
            Bill.create({
                    amount: bill[:amount],
                    due_date: bill[:due_date],
                    status: bill[:status],
                    enrollment_id: bill[:enrollment_id]
            })