backend/Bilinho/app/services/update_bills.rb

SELECT "bills".* FROM "bills" WHERE "bills"."enrollment_id" = $1  [["enrollment_id", 149]]
---
    def initialize(params={})
        @bills=Bill.where(enrollment_id:params[:enrollment_id])

DELETE FROM "bills" WHERE "bills"."id" = $1  [["id", 278]]
---
    def update_bills
        @bills.each do |bill|
            bill.destroy