backend2/Bilinho/app/models/enrollment.rb

INSERT INTO "bills" ("amount", "due_date", "status", "created_at", "updated_at", "enrollment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 1000], ["due_date", "2023-02-28"], ["status", "open"], ["created_at", "2022-12-10 22:49:56.402986"], ["updated_at", "2022-12-10 22:49:56.402986"], ["enrollment_id", 54]]
INSERT INTO "bills" ("amount", "due_date", "status", "created_at", "updated_at", "enrollment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 1500], ["due_date", "2023-02-05"], ["status", "open"], ["created_at", "2022-12-10 22:41:49.963815"], ["updated_at", "2022-12-10 22:41:49.963815"], ["enrollment_id", 42]]
---
    def create_bills
        day=Date.today.day
        year=Date.today.year
        month=Date.today.month
        if (day>due_day)
            month=Date.today.month+1
        end

        count=0
        next_month=0
        while count<installments do
            if(month<=12)
                month=month+next_month
                next_month=1
            end
            if(month>12)
                month=month-12
                year=year+1
                next_month=1
            end
            if (month==2 && due_day>=29)
                bills.create(
                    :amount => amount/installments,
                    :due_date => Date.today.change(day: 28,month:month, year: year),
                )
            else
                bills.create(
                    :amount => amount/installments,
                    :due_date => Date.today.change(day: due_day,month:month, year: year),
                )